Service - Investment Income Reporting/Product - PIE/sample messages/CERFilePayload.xml

CER File Return

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:r="https://services.ird.govt.nz/GWS/Returns/" xmlns:fil="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest" xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Header xmlns:a="http://www.w3.org/2005/08/addressing">
        <a:Action>https://services.ird.govt.nz/GWS/Returns/Return/File</a:Action>
    </soap:Header>
    <soap:Body>
        <r:File>
            <r:ReturnFileRequestMsg>
                <fil:FileRequestWrapper>
                    <ret:fileRequest xmlns:ret="urn:www.ird.govt.nz/GWS:types/ReturnPIEc.v1" xmlns:ret1="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2" xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                        <ret1:fileHeader>
                            <com:softwareProviderData>
                                <com:softwareProvider>softwareProvider</com:softwareProvider>
                                <com:softwarePlatform>softwarePlatform</com:softwarePlatform>
                                <com:softwareRelease>v1</com:softwareRelease>
                            </com:softwareProviderData>
                            <com:identifier IdentifierValueType="IRD">139125150</com:identifier>
                            <com:accountType>PIE</com:accountType>
                            <ret1:periodEndDate>2021-03-31</ret1:periodEndDate>
                            <ret1:majorFormType>PIE</ret1:majorFormType>
                            <ret1:minorFormType>CER</ret1:minorFormType>
                        </ret1:fileHeader>
                        <ret1:fileBody xmlns:ret="urn:www.ird.govt.nz/GWS:types/ReturnPIEc.v1" xmlns:ret1="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                            <ret1:standardFields>
                                <ret1:isNilReturn>false</ret1:isNilReturn>
                                <ret1:isFinalReturn>false</ret1:isFinalReturn>
                                <ret1:amendmentRequest>
                                    <ret1:isAmended>false</ret1:isAmended>
                                    <ret1:amendReason/>
                                    <ret1:amendDetails/>
                                </ret1:amendmentRequest>
                            </ret1:standardFields>
                            <ret1:formFields xsi:type="ret:FormFieldsType">
                                <ret:isReverseReplace>false</ret:isReverseReplace>
                                <ret:lineItems>
                                    <ret:referenceId>abc123</ret:referenceId>
                                    <ret:amendType>A</ret:amendType>
                                    <ret:issuerIRD>139125150</ret:issuerIRD>
                                    <ret:investorName>Peter Parker</ret:investorName>
                                    <ret:investorIRD>132340307</ret:investorIRD>
                                    <ret:investorDOB>1985-12-31</ret:investorDOB>
                                    <ret:investorCertID>abc</ret:investorCertID>
                                    <ret:investorEmail>kia@ora.com</ret:investorEmail>
                                    <ret:investorPhone>38852277</ret:investorPhone>
                                    <ret:jointInvestor>true</ret:jointInvestor>
                                    <ret:certPeriodEndDate>2021-03-31</ret:certPeriodEndDate>
                                    <ret:contactAddress>wellington</ret:contactAddress>
                                    <ret:country>NZ</ret:country>
                                    <ret:homeCountryTaxFilerNumber>xyz123</ret:homeCountryTaxFilerNumber>
                                    <ret:nfidtaCountry>NFIDTA</ret:nfidtaCountry>
                                    <ret:noTaxFileNumber>true</ret:noTaxFileNumber>
                                    <ret:accountHolders>
                                        <ret1:irdNumber>123769732</ret1:irdNumber>
                                        <ret1:dateOfBirth>1985-09-09</ret1:dateOfBirth>
                                        <ret1:name>Peter Parker</ret1:name>
                                        <ret1:address>test address 1</ret1:address>
                                        <ret1:phone>0221234567</ret1:phone>
                                        <ret1:email>parker@spidey.co.nz</ret1:email>
                                        <ret:country>NZ</ret:country>
                                    </ret:accountHolders>
                                    <ret:incomeInformation>
                                        <ret1:incomeType>NRINT</ret1:incomeType>
                                        <ret1:grossAmount>5005</ret1:grossAmount>
                                        <ret1:deductedAmount>53</ret1:deductedAmount>
                                        <ret1:rate>10.5</ret1:rate>
                                        <ret:rateChanged>true</ret:rateChanged>
                                        <ret:unitsAtYearEnd>1000</ret:unitsAtYearEnd>
                                        <ret:totalTaxCredits>1000</ret:totalTaxCredits>
                                        <ret:taxableIncomeLowMid>1000</ret:taxableIncomeLowMid>
                                        <ret:netTaxPaidOnInvestorIncomeLowMid>1000</ret:netTaxPaidOnInvestorIncomeLowMid>
                                        <ret:totalTaxCreditOnInvestorIncomeLowMid>1000</ret:totalTaxCreditOnInvestorIncomeLowMid>
                                        <ret:zeroRateExitedTaxableIncome>1000</ret:zeroRateExitedTaxableIncome>
                                        <ret:zeroRateTotalForeignTaxCredits>1000</ret:zeroRateTotalForeignTaxCredits>
                                        <ret:zeroRateTotalOtherTaxCredits>1000</ret:zeroRateTotalOtherTaxCredits>
                                        <ret:zeroRateTotalICTaxCredits>1000</ret:zeroRateTotalICTaxCredits>
                                        <ret:zeroRateTotalRWTTaxCredits>1000</ret:zeroRateTotalRWTTaxCredits>
                                        <ret:zeroRateTaxPaymentExitedInvestors>1000</ret:zeroRateTaxPaymentExitedInvestors>
                                    </ret:incomeInformation>
                                    <ret:incomeInformation>
                                        <ret1:incomeType>NRINT</ret1:incomeType>
                                        <ret1:grossAmount>5005</ret1:grossAmount>
                                        <ret1:deductedAmount>53</ret1:deductedAmount>
                                        <ret1:rate>10.5</ret1:rate>
                                        <ret:rateChanged>true</ret:rateChanged>
                                        <ret:unitsAtYearEnd>1000</ret:unitsAtYearEnd>
                                        <ret:totalTaxCredits>1000</ret:totalTaxCredits>
                                        <ret:taxableIncomeLowMid>1000</ret:taxableIncomeLowMid>
                                        <ret:netTaxPaidOnInvestorIncomeLowMid>1000</ret:netTaxPaidOnInvestorIncomeLowMid>
                                        <ret:totalTaxCreditOnInvestorIncomeLowMid>1000</ret:totalTaxCreditOnInvestorIncomeLowMid>
                                        <ret:zeroRateExitedTaxableIncome>1000</ret:zeroRateExitedTaxableIncome>
                                        <ret:zeroRateTotalForeignTaxCredits>1000</ret:zeroRateTotalForeignTaxCredits>
                                        <ret:zeroRateTotalOtherTaxCredits>1000</ret:zeroRateTotalOtherTaxCredits>
                                        <ret:zeroRateTotalICTaxCredits>1000</ret:zeroRateTotalICTaxCredits>
                                        <ret:zeroRateTotalRWTTaxCredits>1000</ret:zeroRateTotalRWTTaxCredits>
                                        <ret:zeroRateTaxPaymentExitedInvestors>1000</ret:zeroRateTaxPaymentExitedInvestors>
                                    </ret:incomeInformation>
                                </ret:lineItems>
                                <ret:lineItems>
                                    <ret:referenceId>abc123true</ret:referenceId>
                                    <ret:amendType>A</ret:amendType>
                                    <ret:issuerIRD>139125150</ret:issuerIRD>
                                    <ret:investorName>Peter Parker</ret:investorName>
                                    <ret:investorIRD>132340307</ret:investorIRD>
                                    <ret:investorDOB>1985-12-31</ret:investorDOB>
                                    <ret:investorCertID>abc</ret:investorCertID>
                                    <ret:investorEmail>kia@ora.com</ret:investorEmail>
                                    <ret:investorPhone>38852277</ret:investorPhone>
                                    <ret:jointInvestor>true</ret:jointInvestor>
                                    <ret:certPeriodEndDate>2021-03-31</ret:certPeriodEndDate>
                                    <ret:contactAddress>wellington</ret:contactAddress>
                                    <ret:country>NZ</ret:country>
                                    <ret:homeCountryTaxFilerNumber>xyz123</ret:homeCountryTaxFilerNumber>
                                    <ret:nfidtaCountry>NFIDTA</ret:nfidtaCountry>
                                    <ret:noTaxFileNumber>true</ret:noTaxFileNumber>
                                    <ret:accountHolders>
                                        <ret1:irdNumber>123769732</ret1:irdNumber>
                                        <ret1:dateOfBirth>1985-09-09</ret1:dateOfBirth>
                                        <ret1:name>Peter Parker</ret1:name>
                                        <ret1:address>test address 1</ret1:address>
                                        <ret1:phone>0221234567</ret1:phone>
                                        <ret1:email>parker@spidey.co.nz</ret1:email>
                                        <ret:country>NZ</ret:country>
                                    </ret:accountHolders>
                                    <ret:incomeInformation>
                                        <ret1:incomeType>NRINT</ret1:incomeType>
                                        <ret1:grossAmount>5005</ret1:grossAmount>
                                        <ret1:deductedAmount>53</ret1:deductedAmount>
                                        <ret1:rate>10.5</ret1:rate>
                                        <ret:rateChanged>true</ret:rateChanged>
                                        <ret:unitsAtYearEnd>1000</ret:unitsAtYearEnd>
                                        <ret:totalTaxCredits>1000</ret:totalTaxCredits>
                                        <ret:taxableIncomeLowMid>1000</ret:taxableIncomeLowMid>
                                        <ret:netTaxPaidOnInvestorIncomeLowMid>1000</ret:netTaxPaidOnInvestorIncomeLowMid>
                                        <ret:totalTaxCreditOnInvestorIncomeLowMid>1000</ret:totalTaxCreditOnInvestorIncomeLowMid>
                                        <ret:zeroRateExitedTaxableIncome>1000</ret:zeroRateExitedTaxableIncome>
                                        <ret:zeroRateTotalForeignTaxCredits>1000</ret:zeroRateTotalForeignTaxCredits>
                                        <ret:zeroRateTotalOtherTaxCredits>1000</ret:zeroRateTotalOtherTaxCredits>
                                        <ret:zeroRateTotalICTaxCredits>1000</ret:zeroRateTotalICTaxCredits>
                                        <ret:zeroRateTotalRWTTaxCredits>1000</ret:zeroRateTotalRWTTaxCredits>
                                        <ret:zeroRateTaxPaymentExitedInvestors>1000</ret:zeroRateTaxPaymentExitedInvestors>
                                    </ret:incomeInformation>
                                    <ret:incomeInformation>
                                        <ret1:incomeType>NRINT</ret1:incomeType>
                                        <ret1:grossAmount>5005</ret1:grossAmount>
                                        <ret1:deductedAmount>53</ret1:deductedAmount>
                                        <ret1:rate>10.5</ret1:rate>
                                        <ret:rateChanged>true</ret:rateChanged>
                                        <ret:unitsAtYearEnd>1000</ret:unitsAtYearEnd>
                                        <ret:totalTaxCredits>1000</ret:totalTaxCredits>
                                        <ret:taxableIncomeLowMid>1000</ret:taxableIncomeLowMid>
                                        <ret:netTaxPaidOnInvestorIncomeLowMid>1000</ret:netTaxPaidOnInvestorIncomeLowMid>
                                        <ret:totalTaxCreditOnInvestorIncomeLowMid>1000</ret:totalTaxCreditOnInvestorIncomeLowMid>
                                        <ret:zeroRateExitedTaxableIncome>1000</ret:zeroRateExitedTaxableIncome>
                                        <ret:zeroRateTotalForeignTaxCredits>1000</ret:zeroRateTotalForeignTaxCredits>
                                        <ret:zeroRateTotalOtherTaxCredits>1000</ret:zeroRateTotalOtherTaxCredits>
                                        <ret:zeroRateTotalICTaxCredits>1000</ret:zeroRateTotalICTaxCredits>
                                        <ret:zeroRateTotalRWTTaxCredits>1000</ret:zeroRateTotalRWTTaxCredits>
                                        <ret:zeroRateTaxPaymentExitedInvestors>1000</ret:zeroRateTaxPaymentExitedInvestors>
                                    </ret:incomeInformation>
                                </ret:lineItems>
                            </ret1:formFields>
                        </ret1:fileBody>
                    </ret:fileRequest>
                </fil:FileRequestWrapper>
            </r:ReturnFileRequestMsg>
        </r:File>
    </soap:Body>
</soap:Envelope>